# Ecommerce Clickstream Transaction Data
- Pandas Manipulation Practice
- Typical Ecommerce Clickstream + Transaction Dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("ecommerce_clickstream_transactions.csv")
data.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN
3,1,1,2024-03-12 00:32:05.495638,add_to_cart,prod_4112,NaN,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN

In [3]:
df = data.copy()
df["Date"] = pd.to_datetime(df["Timestamp"]).dt.date
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23
3,1,1,2024-03-12 00:32:05.495638,add_to_cart,prod_4112,NaN,NaN,2024-03-12
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25

# Pandas Manipulation Method Summary

### I/O and quick inspection

- pd.read_csv, pd.read_parquet, pd.read_json, pd.read_excel
- DataFrame.to_csv, to_parquet, to_json, to_excel
- head, tail, sample
- info, describe, dtypes
- value_counts
- unique, nunique
- isna, notna
- memory_usage

In [4]:
df.tail()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
74812,1000,10,2024-05-11 22:48:45.500117,purchase,prod_1238,186.208225,purchase,2024-05-11
74813,1000,10,2024-03-29 04:09:32.514318,logout,NaN,NaN,NaN,2024-03-29
74814,1000,10,2024-02-09 02:58:56.128697,login,NaN,NaN,NaN,2024-02-09
74815,1000,10,2024-04-30 16:19:48.002633,purchase,prod_2515,198.757849,purchase,2024-04-30
74816,1000,10,2024-04-01 02:19:29.148727,logout,NaN,NaN,NaN,2024-04-01

In [5]:
df.sample(5)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
61200,819,2,2024-01-28 04:50:12.009715,purchase,prod_5655,110.234556,purchase,2024-01-28
32028,429,7,2024-01-08 08:32:02.278564,click,NaN,NaN,NaN,2024-01-08
71197,953,10,2024-05-25 00:30:20.063831,product_view,prod_4444,NaN,NaN,2024-05-25
27888,375,2,2024-04-23 03:11:55.913711,product_view,prod_7896,NaN,NaN,2024-04-23
2287,30,10,2024-06-28 19:48:00.995512,product_view,prod_9366,NaN,NaN,2024-06-28

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74817 entries, 0 to 74816
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   UserID     74817 non-null  int64
 1   SessionID  74817 non-null  int64
 2   Timestamp  74817 non-null  object
 3   EventType  74817 non-null  object
 4   ProductID  32113 non-null  object
 5   Amount     10682 non-null  float64
 6   Outcome    10682 non-null  object
 7   Date       74817 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 4.6+ MB

In [7]:
df.dtypes

UserID         int64
SessionID      int64
Timestamp     object
EventType     object
ProductID     object
Amount       float64
Outcome       object
Date          object
dtype: object

In [8]:
df.dtypes.value_counts()

object     5
int64      2
float64    1
dtype: int64

In [9]:
df[df.Timestamp.isna()]

Empty DataFrame
Columns: [UserID, SessionID, Timestamp, EventType, ProductID, Amount, Outcome, Date]
Index: []

In [10]:
df[df.Timestamp.notna()].sample(5)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
24433,328,4,2024-03-22 09:30:42.344062,click,NaN,NaN,NaN,2024-03-22
37089,497,3,2024-06-17 04:48:56.562422,add_to_cart,prod_2146,NaN,NaN,2024-06-17
4541,61,2,2024-06-29 16:52:33.965104,login,NaN,NaN,NaN,2024-06-29
31171,418,4,2024-03-20 13:37:35.407008,click,NaN,NaN,NaN,2024-03-20
38006,509,2,2024-06-05 11:38:23.678327,logout,NaN,NaN,NaN,2024-06-05

In [11]:
df.memory_usage()

Index           128
UserID       598536
SessionID    598536
Timestamp    598536
EventType    598536
ProductID    598536
Amount       598536
Outcome      598536
Date         598536
dtype: int64

### Indexing, Filtering, Selection

- [] column selection
- .loc, .iloc, .at, .iat
- query
- filter (by labels/regex)
- isin
- between
- where, mask
- str.contains, str.startswith
- clip
- drop, dropna
- duplicated, drop_duplicates

In [12]:
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23
3,1,1,2024-03-12 00:32:05.495638,add_to_cart,prod_4112,NaN,NaN,2024-03-12
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25

In [13]:
df.loc[10]

UserID                                1
SessionID                             2
Timestamp    2024-03-31 07:56:23.690975
EventType                        logout
ProductID                           NaN
Amount                              NaN
Outcome                             NaN
Date                         2024-03-31
Name: 10, dtype: object

In [14]:
df.loc[10:15]

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
10,1,2,2024-03-31 07:56:23.690975,logout,NaN,NaN,NaN,2024-03-31
11,1,2,2024-05-16 22:00:13.041682,click,NaN,NaN,NaN,2024-05-16
12,1,2,2024-04-20 05:07:46.892185,product_view,prod_2683,NaN,NaN,2024-04-20
13,1,2,2024-01-30 21:47:38.829172,page_view,NaN,NaN,NaN,2024-01-30
14,1,2,2024-03-06 23:01:09.517819,page_view,NaN,NaN,NaN,2024-03-06
15,1,3,2024-03-15 05:22:41.094810,purchase,prod_5244,72.913619,purchase,2024-03-15

In [15]:
df.loc[10:15, ["UserID", "EventType", "Amount"]]

    UserID     EventType     Amount
10       1        logout        NaN
11       1         click        NaN
12       1  product_view        NaN
13       1     page_view        NaN
14       1     page_view        NaN
15       1      purchase  72.913619

In [16]:
df.iloc[10:15]

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
10,1,2,2024-03-31 07:56:23.690975,logout,NaN,NaN,NaN,2024-03-31
11,1,2,2024-05-16 22:00:13.041682,click,NaN,NaN,NaN,2024-05-16
12,1,2,2024-04-20 05:07:46.892185,product_view,prod_2683,NaN,NaN,2024-04-20
13,1,2,2024-01-30 21:47:38.829172,page_view,NaN,NaN,NaN,2024-01-30
14,1,2,2024-03-06 23:01:09.517819,page_view,NaN,NaN,NaN,2024-03-06

In [17]:
df.iloc[10:15, 1:4]

    SessionID                   Timestamp     EventType
10          2  2024-03-31 07:56:23.690975        logout
11          2  2024-05-16 22:00:13.041682         click
12          2  2024-04-20 05:07:46.892185  product_view
13          2  2024-01-30 21:47:38.829172     page_view
14          2  2024-03-06 23:01:09.517819     page_view

In [18]:
df.iloc[10:15, [1, 2, 5]]

    SessionID                   Timestamp  Amount
10          2  2024-03-31 07:56:23.690975     NaN
11          2  2024-05-16 22:00:13.041682     NaN
12          2  2024-04-20 05:07:46.892185     NaN
13          2  2024-01-30 21:47:38.829172     NaN
14          2  2024-03-06 23:01:09.517819     NaN

In [19]:
### df.at: use it when you need to access a single value for a row/column label pair
### val = df.at[row_label, column_label]

df.at[10, "UserID"]
df.at[3, "EventType"]

'add_to_cart'

In [20]:
### set values using df.at
df.at[3, "EventType"] = "AABBCCDD"
df.at[3, "EventType"]

'AABBCCDD'

In [21]:
### filter rows using SQL-like string expression, instead of writing boolean masks
df.query("EventType == 'AABBCCDD'").head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12

In [22]:
### df index filters
df[df.index.isin([10, 20, 30])]

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
10,1,2,2024-03-31 07:56:23.690975,logout,NaN,NaN,NaN,2024-03-31
20,1,3,2024-02-15 12:46:46.387330,add_to_cart,prod_9851,NaN,NaN,2024-02-15
30,1,4,2024-07-15 16:15:52.074487,purchase,prod_9886,7.677938,purchase,2024-07-15

In [23]:
### df column filters
df[df.EventType.isin(["AABBCCDD", "product_view"])].head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12
12,1,2,2024-04-20 05:07:46.892185,product_view,prod_2683,NaN,NaN,2024-04-20
18,1,3,2024-05-29 13:33:10.268585,product_view,prod_9640,NaN,NaN,2024-05-29
24,1,4,2024-06-10 00:08:42.715781,product_view,prod_5771,NaN,NaN,2024-06-10

In [24]:
### df date filters
df[df.Date.between(pd.to_datetime("2024-01-03").date(), pd.to_datetime("2024-01-07").date())]

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
29,1,4,2024-01-04 09:25:49.705624,add_to_cart,prod_1102,NaN,NaN,2024-01-04
36,1,5,2024-01-03 23:51:05.729189,logout,NaN,NaN,NaN,2024-01-03
65,1,8,2024-01-04 17:09:29.677060,click,NaN,NaN,NaN,2024-01-04
72,1,9,2024-01-06 04:33:39.275154,page_view,NaN,NaN,NaN,2024-01-06
88,2,1,2024-01-04 03:53:06.596449,logout,NaN,NaN,NaN,2024-01-04
...,...,...,...,...,...,...,...,...
74713,999,8,2024-01-05 03:50:16.283889,product_view,prod_9377,NaN,NaN,2024-01-05
74765,1000,4,2024-01-07 23:49:08.108428,product_view,prod_7708,NaN,NaN,2024-01-07
74783,1000,7,2024-01-06 10:18:56.069670,product_view,prod_8279,NaN,NaN,2024-01-06
74785,1000,7,2024-01-03 15:54:55.591340,add_to_cart,prod_3091,NaN,NaN,2024-01-03
74793,1000,8,2024-01-04 19:27:32.361552,logout,NaN,NaN,NaN,2024-01-04

In [25]:
### between
### mask = df["column_name"].between(lower_bound, upper_bound, inclusive="both"/"left"/"right"/"neither")
mask = df["Amount"].between(50, 100, inclusive="both")
df_amount_50_100 = df[mask].copy()
df_amount_50_100.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
15,1,3,2024-03-15 05:22:41.094810,purchase,prod_5244,72.913619,purchase,2024-03-15
102,2,3,2024-01-20 07:23:41.874270,purchase,prod_5291,92.790219,purchase,2024-01-20
172,3,4,2024-07-07 21:23:11.190419,purchase,prod_6789,76.285324,purchase,2024-07-07
465,6,10,2024-03-03 01:47:03.184839,purchase,prod_3829,58.667072,purchase,2024-03-03
525,7,8,2024-05-24 20:36:47.826509,purchase,prod_9259,54.070602,purchase,2024-05-24

In [26]:
### between
### mask = df["Date"].between(pd.to_datetime(timestr1), pd.to_datetime((timestr2)))
mask = df["Date"].between(pd.to_datetime("2024-01-01"), pd.to_datetime(("2024-01-03")))
df_date_20240101_20250103 = df[mask].copy()
df_date_20240101_20250103.head()

/Users/wenxinzhang/miniconda3/envs/py38/lib/python3.8/site-packages/pandas/core/ops/array_ops.py:73: FutureWarning: Comparison of Timestamp with datetime.date is deprecated in order to match the standard library behavior. In a future version these will be considered non-comparable. Use 'ts == pd.Timestamp(date)' or 'ts.date() == date' instead.
  result = libops.scalar_compare(x.ravel(), y, op)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
5,1,1,2024-01-01 23:09:51.956825,page_view,NaN,NaN,NaN,2024-01-01
32,1,4,2024-01-02 00:15:51.420238,add_to_cart,prod_6144,NaN,NaN,2024-01-02
36,1,5,2024-01-03 23:51:05.729189,logout,NaN,NaN,NaN,2024-01-03
97,2,3,2024-01-03 01:39:14.214806,click,NaN,NaN,NaN,2024-01-03
103,2,4,2024-01-01 14:07:40.491141,add_to_cart,prod_8372,NaN,NaN,2024-01-01

In [27]:
### filter rows where EventType contains "CART" (case insensitive)
df[df.EventType.str.contains("CART", case=False, na=False)].sample()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
13053,175,4,2024-02-11 06:54:13.824016,add_to_cart,prod_3150,NaN,NaN,2024-02-11

In [28]:
### filter rows where EventType contains "CART" (case sensitive)
df[df.EventType.str.contains("CART", case=True, na=False)]

Empty DataFrame
Columns: [UserID, SessionID, Timestamp, EventType, ProductID, Amount, Outcome, Date]
Index: []

In [29]:
### filter rows where EventType starts with "add"
df[df.EventType.str.startswith("add", na=False)].sample()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date
5108,68,7,2024-02-11 14:05:41.600699,add_to_cart,prod_2365,NaN,NaN,2024-02-11

In [30]:
### mask: replace values where condition is True
mask = df["EventType"] == "page_view"
x = df["EventType"].mask(mask) # mask the page_view as NaN
x

0                 NaN
1                 NaN
2        product_view
3            AABBCCDD
4         add_to_cart
             ...
74812        purchase
74813          logout
74814           login
74815        purchase
74816          logout
Name: EventType, Length: 74817, dtype: object

In [31]:
### mask: replace values where condition is True
mask = df["EventType"] == "page_view"
x = df["EventType"].mask(mask, other="PV") # mask the page_view as PV
x

0                  PV
1                  PV
2        product_view
3            AABBCCDD
4         add_to_cart
             ...
74812        purchase
74813          logout
74814           login
74815        purchase
74816          logout
Name: EventType, Length: 74817, dtype: object

In [32]:
### mask: replace values where condition is True
mask = df["Amount"] < 0
x = df["Amount"].mask(mask) # mask all the negative values as NaN
x

0               NaN
1               NaN
2               NaN
3               NaN
4               NaN
            ...
74812    186.208225
74813           NaN
74814           NaN
74815    198.757849
74816           NaN
Name: Amount, Length: 74817, dtype: float64

In [33]:
### where: keep values where condition is True, replace others with NaN
mask = df["Amount"] >= 50
df["AmountKept"] = df["Amount"].where(mask)
df[["Amount", "AmountKept"]].sample(10)

       Amount  AmountKept
52586     NaN         NaN
3120      NaN         NaN
53389     NaN         NaN
32626     NaN         NaN
17208     NaN         NaN
53075     NaN         NaN
62634     NaN         NaN
27739     NaN         NaN
31181     NaN         NaN
57647     NaN         NaN

In [34]:
### where: keep values where condition is True, replace others with 0
mask = df["Amount"] >= 50
df["AmountKept"] = df["Amount"].where(mask, other=0)
df[["Amount", "AmountKept"]].sample(10)

           Amount  AmountKept
23823         NaN    0.000000
67211  170.542602  170.542602
34190         NaN    0.000000
32779         NaN    0.000000
31410         NaN    0.000000
57568         NaN    0.000000
6987          NaN    0.000000
21689  447.719052  447.719052
17601         NaN    0.000000
67063         NaN    0.000000

- s.mask(condition) = s.where(~condition)
- `mask` triggers replacement when condition is True
- `where` keeps where condition is True

In [35]:
### clip: cap/ floor values
### greater than upper bound -> set to upper bound
### less than lower bound -> set to lower bound 
### great for outliers/ winsorizing
df["AmountClipped"] = df["Amount"].clip(lower=0, upper=100)
df[["Amount", "AmountClipped"]].sample(10)

         Amount  AmountClipped
41357       NaN            NaN
23861       NaN            NaN
71165  72.80384       72.80384
33866       NaN            NaN
58334       NaN            NaN
699         NaN            NaN
60554       NaN            NaN
49925       NaN            NaN
14435       NaN            NaN
74674  71.92695       71.92695

In [36]:
### with quantiles
df["AmountClippedQuantile"] = df["Amount"].clip(
    lower=df["Amount"].quantile(0.2),
    upper=df["Amount"].quantile(0.8)
)
df[["Amount", "AmountClippedQuantile"]].sample(10)

           Amount  AmountClippedQuantile
16040         NaN                    NaN
33182         NaN                    NaN
56291         NaN                    NaN
45615   13.599672             106.869794
34016         NaN                    NaN
25027         NaN                    NaN
30960  408.005126             403.621669
46709         NaN                    NaN
51897  384.009675             384.009675
35836  447.373368             403.621669

In [37]:
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN

In [38]:
### drop: remove rows by index label
df2 = df.drop(index=[0, 1, 2, 3, 4])
df2.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
5,1,1,2024-01-01 23:09:51.956825,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN
6,1,1,2024-02-01 05:13:26.944169,add_to_cart,prod_4965,NaN,NaN,2024-02-01,0.0,NaN,NaN
7,1,1,2024-02-14 15:41:53.071258,login,NaN,NaN,NaN,2024-02-14,0.0,NaN,NaN
8,1,1,2024-05-20 23:13:38.011189,click,NaN,NaN,NaN,2024-05-20,0.0,NaN,NaN
9,1,2,2024-06-27 16:17:34.523695,page_view,NaN,NaN,NaN,2024-06-27,0.0,NaN,NaN

In [39]:
### drop with errors ignored
df2 = df.drop(columns='maybe_missing_column', errors='ignore')
df2.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN

In [40]:
### dropna: remove columns with all NaN values
df2 = df.dropna(axis=1, how='all')
df2.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN

In [41]:
### dropna: remove missing values
print(df.shape)

### remove rows with NaN in 'Amount' or 'EventType'
print(df.dropna(subset=['Amount', 'EventType']).shape)

(74817, 11)
(10682, 11)

In [42]:
### keep rows that have at least k non-null values
### keep rows with at least 3 non-null values
df2 = df.dropna(thresh=3)
df2.tail()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
74812,1000,10,2024-05-11 22:48:45.500117,purchase,prod_1238,186.208225,purchase,2024-05-11,186.208225,100.0,186.208225
74813,1000,10,2024-03-29 04:09:32.514318,logout,NaN,NaN,NaN,2024-03-29,0.000000,NaN,NaN
74814,1000,10,2024-02-09 02:58:56.128697,login,NaN,NaN,NaN,2024-02-09,0.000000,NaN,NaN
74815,1000,10,2024-04-30 16:19:48.002633,purchase,prod_2515,198.757849,purchase,2024-04-30,198.757849,100.0,198.757849
74816,1000,10,2024-04-01 02:19:29.148727,logout,NaN,NaN,NaN,2024-04-01,0.000000,NaN,NaN

In [43]:
### drop rows where all values are NaN
df2 = df.dropna(how='all')
df2.tail()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
74812,1000,10,2024-05-11 22:48:45.500117,purchase,prod_1238,186.208225,purchase,2024-05-11,186.208225,100.0,186.208225
74813,1000,10,2024-03-29 04:09:32.514318,logout,NaN,NaN,NaN,2024-03-29,0.000000,NaN,NaN
74814,1000,10,2024-02-09 02:58:56.128697,login,NaN,NaN,NaN,2024-02-09,0.000000,NaN,NaN
74815,1000,10,2024-04-30 16:19:48.002633,purchase,prod_2515,198.757849,purchase,2024-04-30,198.757849,100.0,198.757849
74816,1000,10,2024-04-01 02:19:29.148727,logout,NaN,NaN,NaN,2024-04-01,0.000000,NaN,NaN

In [44]:
### duplicated
dup = df.duplicated()
df[dup].head()

Empty DataFrame
Columns: [UserID, SessionID, Timestamp, EventType, ProductID, Amount, Outcome, Date, AmountKept, AmountClipped, AmountClippedQuantile]
Index: []

In [45]:
### by subset of columns
dup = df.duplicated(subset=["UserID", "SessionID"])
df[dup].head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN
5,1,1,2024-01-01 23:09:51.956825,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN

In [46]:
### default: mark duplicates except for the first occurrence
df.duplicated(subset=["UserID", "SessionID"], keep="first")

0        False
1         True
2         True
3         True
4         True
         ...
74812     True
74813     True
74814     True
74815     True
74816     True
Length: 74817, dtype: bool

In [47]:
### default: mark duplicates except for the last occurrence
df.duplicated(subset=["UserID", "SessionID"], keep="last")

0         True
1         True
2         True
3         True
4         True
         ...
74812     True
74813     True
74814     True
74815     True
74816    False
Length: 74817, dtype: bool

In [48]:
### mark all duplicates
df.duplicated(subset=["UserID", "SessionID"], keep=False)

0        True
1        True
2        True
3        True
4        True
         ...
74812    True
74813    True
74814    True
74815    True
74816    True
Length: 74817, dtype: bool

In [49]:
### most-frequently used cleanup: keep the last occurrence of duplicates
df.drop_duplicates(subset=["UserID", "SessionID"], keep="last").head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
8,1,1,2024-05-20 23:13:38.011189,click,NaN,NaN,NaN,2024-05-20,0.0,NaN,NaN
14,1,2,2024-03-06 23:01:09.517819,page_view,NaN,NaN,NaN,2024-03-06,0.0,NaN,NaN
23,1,3,2024-07-17 03:46:13.897763,add_to_cart,prod_6426,NaN,NaN,2024-07-17,0.0,NaN,NaN
33,1,4,2024-03-19 08:57:34.658875,add_to_cart,prod_5644,NaN,NaN,2024-03-19,0.0,NaN,NaN
42,1,5,2024-02-17 19:31:30.144156,purchase,prod_2362,35.606156,purchase,2024-02-17,0.0,35.606156,106.869794

### Sorting, Ranking, Ordering
- sort_values, sort_index
- nlargest, nsmallest
- rank
- reindex
- reset_index, set_index

In [50]:
df.sort_values("Amount", ascending=False).head(5)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
41716,558,3,2024-07-13 17:24:21.619401,purchase,prod_5885,499.981538,purchase,2024-07-13,499.981538,100.0,403.621669
41244,551,9,2024-03-31 23:28:07.302082,purchase,prod_8038,499.815255,purchase,2024-03-31,499.815255,100.0,403.621669
54792,733,8,2024-01-19 06:20:35.677150,purchase,prod_5885,499.800029,purchase,2024-01-19,499.800029,100.0,403.621669
44480,595,3,2024-02-08 01:07:46.906120,purchase,prod_2611,499.773356,purchase,2024-02-08,499.773356,100.0,403.621669
51077,683,9,2024-05-25 09:34:16.681479,purchase,prod_7389,499.649764,purchase,2024-05-25,499.649764,100.0,403.621669

In [51]:
df.sort_values(["Amount", "Timestamp"],
               ascending=[False, True],
               na_position="last").head(5)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
41716,558,3,2024-07-13 17:24:21.619401,purchase,prod_5885,499.981538,purchase,2024-07-13,499.981538,100.0,403.621669
41244,551,9,2024-03-31 23:28:07.302082,purchase,prod_8038,499.815255,purchase,2024-03-31,499.815255,100.0,403.621669
54792,733,8,2024-01-19 06:20:35.677150,purchase,prod_5885,499.800029,purchase,2024-01-19,499.800029,100.0,403.621669
44480,595,3,2024-02-08 01:07:46.906120,purchase,prod_2611,499.773356,purchase,2024-02-08,499.773356,100.0,403.621669
51077,683,9,2024-05-25 09:34:16.681479,purchase,prod_7389,499.649764,purchase,2024-05-25,499.649764,100.0,403.621669

In [52]:
df.sort_values(["Amount", "Timestamp"],
               ascending=[False, True],
               na_position="last",
               ignore_index=True).head(5)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
0,558,3,2024-07-13 17:24:21.619401,purchase,prod_5885,499.981538,purchase,2024-07-13,499.981538,100.0,403.621669
1,551,9,2024-03-31 23:28:07.302082,purchase,prod_8038,499.815255,purchase,2024-03-31,499.815255,100.0,403.621669
2,733,8,2024-01-19 06:20:35.677150,purchase,prod_5885,499.800029,purchase,2024-01-19,499.800029,100.0,403.621669
3,595,3,2024-02-08 01:07:46.906120,purchase,prod_2611,499.773356,purchase,2024-02-08,499.773356,100.0,403.621669
4,683,9,2024-05-25 09:34:16.681479,purchase,prod_7389,499.649764,purchase,2024-05-25,499.649764,100.0,403.621669

In [53]:
df.sort_values(["Amount", "Timestamp"],
               ascending=[False, True],
               na_position="first").head(5)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
13147,176,7,2024-01-01 00:01:35.004064,logout,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN
72919,976,4,2024-01-01 00:02:24.971658,product_view,prod_1303,NaN,NaN,2024-01-01,0.0,NaN,NaN
69019,925,2,2024-01-01 00:06:24.553313,login,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN
46632,624,1,2024-01-01 00:26:02.151406,product_view,prod_6754,NaN,NaN,2024-01-01,0.0,NaN,NaN
25407,341,5,2024-01-01 00:28:14.885796,login,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN

In [54]:
### nlargest: get top n rows by column values
### nsmallest: get bottom n rows by column values
df.nlargest(5, "Amount")

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
41716,558,3,2024-07-13 17:24:21.619401,purchase,prod_5885,499.981538,purchase,2024-07-13,499.981538,100.0,403.621669
41244,551,9,2024-03-31 23:28:07.302082,purchase,prod_8038,499.815255,purchase,2024-03-31,499.815255,100.0,403.621669
54792,733,8,2024-01-19 06:20:35.677150,purchase,prod_5885,499.800029,purchase,2024-01-19,499.800029,100.0,403.621669
44480,595,3,2024-02-08 01:07:46.906120,purchase,prod_2611,499.773356,purchase,2024-02-08,499.773356,100.0,403.621669
51077,683,9,2024-05-25 09:34:16.681479,purchase,prod_7389,499.649764,purchase,2024-05-25,499.649764,100.0,403.621669

In [55]:
df.nsmallest(5, "Amount")

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile
823,11,6,2024-07-08 14:49:58.100765,purchase,prod_8995,5.131843,purchase,2024-07-08,0.0,5.131843,106.869794
58610,784,8,2024-02-16 04:26:06.194128,purchase,prod_9314,5.224550,purchase,2024-02-16,0.0,5.224550,106.869794
27146,365,2,2024-03-23 00:51:40.162129,purchase,prod_2625,5.407982,purchase,2024-03-23,0.0,5.407982,106.869794
25656,344,7,2024-02-29 03:47:45.112983,purchase,prod_6880,5.491260,purchase,2024-02-29,0.0,5.491260,106.869794
57766,773,2,2024-03-28 05:56:12.425685,purchase,prod_5203,5.527694,purchase,2024-03-28,0.0,5.527694,106.869794

In [56]:
### rank: assign ranks to rows based on column values
df["AmountRank"] = df["Amount"].rank(ascending=False)
df[["Amount", "AmountRank"]].sample(10)

           Amount  AmountRank
12124         NaN         NaN
41864         NaN         NaN
64661  144.908645      7686.0
37583  268.340801      5005.0
51421         NaN         NaN
36809   67.788264      9339.0
27205         NaN         NaN
66131         NaN         NaN
68402         NaN         NaN
56905         NaN         NaN

In [57]:
### set_index
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile,AmountRank
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN,NaN
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN,NaN
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN,NaN
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN,NaN

In [58]:
df.set_index("UserID").head()

,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile,AmountRank
UserID,,,,,,,,,,,
1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN,NaN
1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN,NaN
1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN,NaN
1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN,NaN
1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN,NaN

In [59]:
df.set_index(["UserID", "Timestamp"]).head()

                                   SessionID     EventType  ProductID  Amount  \
UserID Timestamp
1      2024-07-07 18:00:26.959902          1     page_view        NaN     NaN
       2024-03-05 22:01:00.072000          1     page_view        NaN     NaN
       2024-03-23 22:08:10.568453          1  product_view  prod_8199     NaN
       2024-03-12 00:32:05.495638          1      AABBCCDD  prod_4112     NaN
       2024-02-25 22:43:01.318876          1   add_to_cart  prod_3354     NaN

                                  Outcome        Date  AmountKept  \
UserID Timestamp
1      2024-07-07 18:00:26.959902     NaN  2024-07-07         0.0
       2024-03-05 22:01:00.072000     NaN  2024-03-05         0.0
       2024-03-23 22:08:10.568453     NaN  2024-03-23         0.0
       2024-03-12 00:32:05.495638     NaN  2024-03-12         0.0
       2024-02-25 22:43:01.318876     NaN  2024-02-25         0.0

                                   AmountClipped  AmountClippedQuantile  \
UserID Timestamp
1      2024-07-07 18:00:26.959902            NaN                    NaN
       2024-03-05 22:01:00.072000            NaN                    NaN
       2024-03-23 22:08:10.568453            NaN                    NaN
       2024-03-12 00:32:05.495638            NaN                    NaN
       2024-02-25 22:43:01.318876            NaN                    NaN

                                   AmountRank
UserID Timestamp
1      2024-07-07 18:00:26.959902         NaN
       2024-03-05 22:01:00.072000         NaN
       2024-03-23 22:08:10.568453         NaN
       2024-03-12 00:32:05.495638         NaN
       2024-02-25 22:43:01.318876         NaN

In [60]:
df.set_index("Timestamp", drop=False).head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile,AmountRank
Timestamp,,,,,,,,,,,,
2024-07-07 18:00:26.959902,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN,NaN
2024-03-05 22:01:00.072000,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN,NaN
2024-03-23 22:08:10.568453,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN,NaN
2024-03-12 00:32:05.495638,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN,NaN
2024-02-25 22:43:01.318876,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN,NaN

### Column Creation and Transformation
- assign
- rename
- astype
- apply (row/col-wise)
- map
- replace
- transform (group-wise feature creation)
- pipe (clean pipelines)
- eval (sometimes)
- round

In [61]:
### assign: add new columns
df = df.assign(Purchase=df.Outcome == "purchase")
df[["UserID", "Outcome", "Purchase"]].sample(10)

       UserID   Outcome  Purchase
64666     865       NaN     False
37491     502       NaN     False
2239       30       NaN     False
53709     719       NaN     False
21134     284       NaN     False
39280     525       NaN     False
15139     202       NaN     False
55514     743       NaN     False
55069     737  purchase      True
60702     812       NaN     False

In [62]:
### rename: rename columns using a function
df2 = df.rename(columns=str.lower)
df2.head(3)

,userid,sessionid,timestamp,eventtype,productid,amount,outcome,date,amountkept,amountclipped,amountclippedquantile,amountrank,purchase
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN,NaN,False
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN,NaN,False
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN,NaN,False

In [63]:
### rename: rename columns using a mapping dict
df2 = df2.rename(columns={"userid":"UserID", "outcome":"Outcome"})
df2.head(3)

,UserID,sessionid,timestamp,eventtype,productid,amount,Outcome,date,amountkept,amountclipped,amountclippedquantile,amountrank,purchase
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN,NaN,False
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN,NaN,False
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN,NaN,False

In [64]:
### astype: cast dtypes
### astype("str")
print(df["UserID"].dtype)
df["UserID"] = df["UserID"].astype("str")
df["UserID"].dtype

int64

dtype('O')

In [65]:
### astype("boolean")
df["Purchase"] = df["Purchase"].astype("boolean")
df["Purchase"].dtype

BooleanDtype

In [66]:
### pd.to_datetime: convert to datetime dtype
df["Timestamp"] = pd.to_datetime(df["Timestamp"], errors="coerce")
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile,AmountRank,Purchase
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN,NaN,False
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,NaN,NaN,False
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,NaN,NaN,False
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,NaN,NaN,False
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,NaN,NaN,False

In [67]:
### apply: (row/ col-wise) apply a function along an axis of the DataFrame
df["EventType_ProductID"] = df.apply(lambda row: f"{row.EventType}_{row.ProductID}" 
                        if pd.notna(row.ProductID) else row.EventType, 
                        axis=1)
df[["EventType", "ProductID", "EventType_ProductID"]].sample(10)

          EventType  ProductID     EventType_ProductID
20911        logout        NaN                  logout
72686         click        NaN                   click
14013         login        NaN                   login
62064     page_view        NaN               page_view
12384   add_to_cart  prod_8604   add_to_cart_prod_8604
66669     page_view        NaN               page_view
3098          login        NaN                   login
60066        logout        NaN                  logout
67410         login        NaN                   login
8739   product_view  prod_7042  product_view_prod_7042

In [68]:
df.EventType.unique()

array(['page_view', 'product_view', 'AABBCCDD', 'add_to_cart', 'login',
       'click', 'logout', 'purchase'], dtype=object)

In [69]:
### map: series value mapping, element-wise
mapping_dict = {
    "purchase": 1,
    "add_to_cart": 2,
    "product_view": 3,
    "page_view": 4,
    "login": 5,
    "logout": 6,
    "click": 7
}
df["EventTypeCode"] = df["EventType"].map(mapping_dict)
df[["EventType", "EventTypeCode"]].sample(10)

         EventType  EventTypeCode
23068    page_view            4.0
44070        login            5.0
47319        click            7.0
23369  add_to_cart            2.0
2942         login            5.0
35397    page_view            4.0
40078       logout            6.0
25776        login            5.0
55998        click            7.0
73345  add_to_cart            2.0

In [70]:
### replace: series value replacement, element-wise
mapping_dict = {
    "purchase": "Purchase",
    "add_to_cart": "AddToCart",
    "product_view": "ProductView",
    "page_view": "PageView",
    "login": "Login",
    "logout": "Logout",
    "click": "Click"
}
df["EventTypeCode"] = df["EventType"].replace(mapping_dict)
df[["EventType", "EventTypeCode"]].sample(10)

         EventType EventTypeCode
63338     purchase      Purchase
3514         login         Login
72773    page_view      PageView
26985    page_view      PageView
61439        login         Login
7512   add_to_cart     AddToCart
72080  add_to_cart     AddToCart
46953        click         Click
568      page_view      PageView
13774        login         Login

In [71]:
### transform: group-wise transformation
### agg: reduces rows (one row per group)
### transfrom: returns same shape as original DataFrame

### Example: z-score normalization of Amount per UserID
df["UserAmountZscore"] = df.groupby("UserID")["Amount"].transform(
    lambda x: (x - x.mean()) / x.std()
)
df[["UserID", "Amount", "UserAmountZscore"]].sample(5)

      UserID      Amount  UserAmountZscore
28882    388         NaN               NaN
3837      51         NaN               NaN
12551    168  123.759822         -0.785517
67899    909         NaN               NaN
28981    389         NaN               NaN

In [72]:
df["UserIDAvgAmount"] = df.groupby("UserID")["Amount"].transform("mean")
df[["UserID", "Amount", "UserIDAvgAmount"]].sample(5)

      UserID  Amount  UserIDAvgAmount
43282    579     NaN       237.688832
3492      47     NaN       204.140751
40956    548     NaN       236.743448
70543    944     NaN       268.405502
59143    791     NaN       258.714653

In [73]:
### round: round numerical columns to specified decimals
df["AmountRounded2"] = df["Amount"].round(2)
df[["Amount", "AmountRounded2"]].sample(5)

           Amount  AmountRounded2
21920  184.688249          184.69
5923          NaN             NaN
14327         NaN             NaN
16284         NaN             NaN
68544         NaN             NaN

### String Manipulation (str)
- str.lower, str.upper, str.strip
- str.contains, str.match
- str.replace
- str.split, str.extract
- str.len
- str.startswith, str.endswith

In [74]:
### str methods: vectorized string operations
### str.upper(), str.lower(), str.title(), str.capitalize()
### Difference of str.title() and str.capitalize():
### str.title(): capitalize the first letter of each word
### str.capitalize(): capitalize only the first letter of the entire string

df["EventTypeCodeLower"] = df["EventTypeCode"].str.lower()
df["EventTypeCodeUpper"] = df["EventTypeCode"].str.upper()
df["EventTypeCodeTitle"] = df["EventTypeCode"].str.title()
df["EventTypeCodeCapitalized"] = df["EventTypeCode"].str.capitalize()

df[["EventTypeCode", "EventTypeCodeLower", "EventTypeCodeUpper", "EventTypeCodeTitle","EventTypeCodeCapitalized"]].sample(5)

,EventTypeCode,EventTypeCodeLower,EventTypeCodeUpper,EventTypeCodeTitle,EventTypeCodeCapitalized
34950,Click,click,CLICK,Click,Click
12422,AddToCart,addtocart,ADDTOCART,Addtocart,Addtocart
52713,Click,click,CLICK,Click,Click
61616,Purchase,purchase,PURCHASE,Purchase,Purchase
55441,Login,login,LOGIN,Login,Login

In [75]:
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,...,Purchase,EventType_ProductID,EventTypeCode,UserAmountZscore,UserIDAvgAmount,AmountRounded2,EventTypeCodeLower,EventTypeCodeUpper,EventTypeCodeTitle,EventTypeCodeCapitalized
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,...,False,page_view,PageView,NaN,249.516097,NaN,pageview,PAGEVIEW,Pageview,Pageview
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,2024-03-05,0.0,NaN,...,False,page_view,PageView,NaN,249.516097,NaN,pageview,PAGEVIEW,Pageview,Pageview
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,2024-03-23,0.0,NaN,...,False,product_view_prod_8199,ProductView,NaN,249.516097,NaN,productview,PRODUCTVIEW,Productview,Productview
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,2024-03-12,0.0,NaN,...,False,AABBCCDD_prod_4112,AABBCCDD,NaN,249.516097,NaN,aabbccdd,AABBCCDD,Aabbccdd,Aabbccdd
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,2024-02-25,0.0,NaN,...,False,add_to_cart_prod_3354,AddToCart,NaN,249.516097,NaN,addtocart,ADDTOCART,Addtocart,Addtocart

In [76]:
### str.strip: remove leading and trailing whitespace
df["EventTypeCodeWithSpaces"] = "  " + df["EventTypeCode"] + "   "
df["EventTypeCodeStripped"] = df["EventTypeCodeWithSpaces"].str.strip()
print(df[["EventTypeCodeWithSpaces", "EventTypeCodeStripped"]].iloc[1, 0])
print(df[["EventTypeCodeWithSpaces", "EventTypeCodeStripped"]].iloc[1, 1])

  PageView
PageView

In [77]:
### replace: series value replacement, element-wise
df["EventTypeCodeReplaced"] = df["EventTypeCode"].str.replace("View", "Viewed")
df[["EventTypeCode", "EventTypeCodeReplaced"]].sample(5)

      EventTypeCode EventTypeCodeReplaced
52800   ProductView         ProductViewed
5895         Logout                Logout
59987     AddToCart             AddToCart
71086   ProductView         ProductViewed
662          Logout                Logout

In [78]:
### split/ extract: split strings into multiple columns
df["Event_MainType"] = df["EventType"].str.split("_").str[0]
df["Event_SubType"] = df["EventType"].str.split("_").str[1]
df[["EventType", "Event_MainType", "Event_SubType"]].sample(5)

       EventType Event_MainType Event_SubType
11564  page_view           page          view
14983     logout         logout           NaN
57441     logout         logout           NaN
49197      click          click           NaN
4712      logout         logout           NaN

In [79]:
### str.split
df[["year", "month", "day"]] = df["Date"].astype("str").str.split("-", expand=True)
df[["Date", "year", "month", "day"]].sample(5)

             Date  year month day
47026  2024-02-07  2024    02  07
22750  2024-05-12  2024    05  12
31379  2024-06-07  2024    06  07
12608  2024-03-09  2024    03  09
73403  2024-01-06  2024    01  06

In [80]:
### str.len
df["EventTypeLength"] = df["EventType"].str.len()
df[["EventType", "EventTypeLength"]].sample(5)

       EventType  EventTypeLength
19846      login                5
27914  page_view                9
44949  page_view                9
29269   purchase                8
33222      click                5

In [81]:
### Prefix Checks
df[df.EventType.str.startswith("add", na=False)].sample(3)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,...,EventTypeCodeCapitalized,EventTypeCodeWithSpaces,EventTypeCodeStripped,EventTypeCodeReplaced,Event_MainType,Event_SubType,year,month,day,EventTypeLength
10240,137,3,2024-07-08 07:55:25.712689,add_to_cart,prod_8166,NaN,NaN,2024-07-08,0.0,NaN,...,Addtocart,AddToCart,AddToCart,AddToCart,add,to,2024,07,08,11
32610,437,3,2024-01-01 08:33:02.890301,add_to_cart,prod_2847,NaN,NaN,2024-01-01,0.0,NaN,...,Addtocart,AddToCart,AddToCart,AddToCart,add,to,2024,01,01,11
9557,127,9,2024-04-07 10:09:27.631147,add_to_cart,prod_2090,NaN,NaN,2024-04-07,0.0,NaN,...,Addtocart,AddToCart,AddToCart,AddToCart,add,to,2024,04,07,11

In [82]:
### Suffix Checks
df[df.EventType.str.endswith("view", na=False)].sample(3)

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,...,EventTypeCodeCapitalized,EventTypeCodeWithSpaces,EventTypeCodeStripped,EventTypeCodeReplaced,Event_MainType,Event_SubType,year,month,day,EventTypeLength
23271,312,9,2024-06-07 02:00:19.301711,page_view,NaN,NaN,NaN,2024-06-07,0.0,NaN,...,Pageview,PageView,PageView,PageViewed,page,view,2024,06,07,9
2349,31,8,2024-05-25 01:05:22.428587,product_view,prod_8997,NaN,NaN,2024-05-25,0.0,NaN,...,Productview,ProductView,ProductView,ProductViewed,product,view,2024,05,25,12
31217,418,9,2024-07-10 05:37:39.788150,product_view,prod_7963,NaN,NaN,2024-07-10,0.0,NaN,...,Productview,ProductView,ProductView,ProductViewed,product,view,2024,07,10,12

### Datetime Manipulation (dt)
- pd.to_datetime
- .dt.date, .dt.normalize
- .dt.year, .dt.month, .dt.day, .dt.weekday
- .dt.floor, .dt.ceil, .dt.round
- .dt.to_period
- pd.date_range
- pd.Timedelta, pd.DateOffset

- Timezone-aware: the datetime already "knows" the timezone | `aware` -> change timezone: `tz_convert()`
- Timezone-naive: the datetime "does not know" the timezone | `naive` -> add timezone: `tz_localize()`

In [83]:
s = pd.to_datetime(df["Timestamp"], errors="coerce")
print(s.dt.tz)

### if it prints None: the datetime is timezone-naive (not timezone-aware)
### if it prints UTC or America/ New_York: the datetime is timezone-aware --- IGNORE ---

None

- First parse the datetime column, otherwise the tz func will easily fail

In [84]:
ts = pd.to_datetime(df["Timestamp"], errors="coerce")
ts

0       2024-07-07 18:00:26.959902
1       2024-03-05 22:01:00.072000
2       2024-03-23 22:08:10.568453
3       2024-03-12 00:32:05.495638
4       2024-02-25 22:43:01.318876
                   ...
74812   2024-05-11 22:48:45.500117
74813   2024-03-29 04:09:32.514318
74814   2024-02-09 02:58:56.128697
74815   2024-04-30 16:19:48.002633
74816   2024-04-01 02:19:29.148727
Name: Timestamp, Length: 74817, dtype: datetime64[ns]

- `Native + UTC`
- If the datetime is timezone-naive, and it's UTC time, we can `add the timezone info using tz_localize('UTC')`

In [85]:
df["Timestamp_UTC"] = df["Timestamp"].dt.tz_localize("UTC")
df[["Timestamp", "Timestamp_UTC"]].head()

                   Timestamp                    Timestamp_UTC
0 2024-07-07 18:00:26.959902 2024-07-07 18:00:26.959902+00:00
1 2024-03-05 22:01:00.072000 2024-03-05 22:01:00.072000+00:00
2 2024-03-23 22:08:10.568453 2024-03-23 22:08:10.568453+00:00
3 2024-03-12 00:32:05.495638 2024-03-12 00:32:05.495638+00:00
4 2024-02-25 22:43:01.318876 2024-02-25 22:43:01.318876+00:00

- `Naive + NY`
- If the datetime is timezone-naive, and it's in another timezone (e.g., New York time), we can `add the timezone info using tz_localize('America/New_York')`

In [86]:
# df["Timestamp_NY"] = df["Timestamp"].dt.tz_localize("America/New_York")
# df[["Timestamp", "Timestamp_NY"]].head()

# NonExistentTimeError: 2024-03-10 02:02:55.545471 does not exist in timezone America/New_York
# This is because on March 10, 2024, at 2:00 AM, clocks in New York spring forward to 3:00 AM for Daylight Saving Time.
# Therefore, any timestamp between 2:00 AM and 2:59 AM on that date does not exist in the America/New_York timezone.

- `Convert Timezone`
- convert the timezone-aware datetime to another timezone with tz.convert()

In [87]:
# df["Timestamp_NY"] = df["Timestamp_UTC"].dt.tz_convert("America/New_York")
# df[["Timestamp", "Timestamp_UTC", "Timestamp_NY"]].head()

- Always store a canonical UTC column (Timestamp_UTC) and derive others from it with tz_convert.
- That avoids DST nonexistent time headaches entirely (because UTC has no gaps).

- .dt methods only work if the dtype is datetime-like or tz-aware.
- If the dtype is not datetime-like or tz-aware, you'll get an error when trying to use .dt methods

In [88]:
df["date"] = df["Timestamp"].dt.date
df[["date", "Timestamp"]].head()

         date                  Timestamp
0  2024-07-07 2024-07-07 18:00:26.959902
1  2024-03-05 2024-03-05 22:01:00.072000
2  2024-03-23 2024-03-23 22:08:10.568453
3  2024-03-12 2024-03-12 00:32:05.495638
4  2024-02-25 2024-02-25 22:43:01.318876

In [89]:
df["year"] = df["Timestamp"].dt.year
df["month"] = df["Timestamp"].dt.month
df["month_name"]   = df["Timestamp"].dt.month_name()
df["day"] = df["Timestamp"].dt.day
df["weekday"] = df["Timestamp"].dt.weekday
df["weekday_name"] = df["Timestamp"].dt.day_name()

df[["Timestamp", "year", "month", "month_name", "day", "weekday_name", "weekday"]].head()

,Timestamp,year,month,month_name,day,weekday_name,weekday
0,2024-07-07 18:00:26.959902,2024,7,July,7,Sunday,6
1,2024-03-05 22:01:00.072000,2024,3,March,5,Tuesday,1
2,2024-03-23 22:08:10.568453,2024,3,March,23,Saturday,5
3,2024-03-12 00:32:05.495638,2024,3,March,12,Tuesday,1
4,2024-02-25 22:43:01.318876,2024,2,February,25,Sunday,6

- dt.floor
- dt.ceil
- dt.round

In [90]:
### .dt.floor()
df["ts_5min"] = df["Timestamp"].dt.floor("5min")
df["ts_hour"] = df["Timestamp"].dt.floor("H")
df["ts_day"]  = df["Timestamp"].dt.floor("D")
df[["Timestamp", "ts_5min", "ts_hour", "ts_day"]].sample()

,Timestamp,ts_5min,ts_hour,ts_day
20402,2024-05-16 02:05:37.084737,2024-05-16 02:05:00,2024-05-16 02:00:00,2024-05-16

In [91]:
### .dt.ceil()
df["ts_ceil_hour"]  = df["Timestamp"].dt.ceil("H")

### .dt.round()
df["ts_round_15m"]  = df["Timestamp"].dt.round("15min")
df[["Timestamp", "ts_ceil_hour", "ts_round_15m"]].sample(5)

                       Timestamp        ts_ceil_hour        ts_round_15m
60950 2024-04-11 12:01:06.057677 2024-04-11 13:00:00 2024-04-11 12:00:00
23000 2024-01-31 12:27:15.632606 2024-01-31 13:00:00 2024-01-31 12:30:00
25068 2024-05-12 10:25:55.449271 2024-05-12 11:00:00 2024-05-12 10:30:00
53482 2024-01-04 22:00:39.178477 2024-01-04 23:00:00 2024-01-04 22:00:00
47851 2024-06-09 18:46:55.222223 2024-06-09 19:00:00 2024-06-09 18:45:00

In [92]:
### .dt.to_period: converts to periods like month/ quarter
df["month"] = df["Timestamp"].dt.to_period("M")
df["quarter"] = df["Timestamp"].dt.to_period("Q")

df[["Timestamp", "month", "quarter"]].head()

                   Timestamp    month quarter
0 2024-07-07 18:00:26.959902  2024-07  2024Q3
1 2024-03-05 22:01:00.072000  2024-03  2024Q1
2 2024-03-23 22:08:10.568453  2024-03  2024Q1
3 2024-03-12 00:32:05.495638  2024-03  2024Q1
4 2024-02-25 22:43:01.318876  2024-02  2024Q1

Frequency String Options
- Y, A: year
- Q: quarter
- M: month
- W: week
- D: day
- B: business day (Mon-Fri)
---
- H: hour
- T, min: minute
- S: second
- L, ms: millisecond
- U, us: microsecond
- N: nanosecond
---
- week ending day: W-MON, W-SUN, etc
- quarter/ year: Q-AMR, Q-JUN, etc

In [93]:
df.groupby(df["Timestamp"].dt.to_period("M"))["Amount"].sum()

Timestamp
2024-01    402125.529562
2024-02    376519.999302
2024-03    394057.928816
2024-04    408235.696660
2024-05    426323.724682
2024-06    402153.223718
2024-07    295156.896708
Freq: M, Name: Amount, dtype: float64

In [94]:
days = pd.date_range("2025-01-01", "2025-01-31", freq="D")
days

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10', '2025-01-11', '2025-01-12',
               '2025-01-13', '2025-01-14', '2025-01-15', '2025-01-16',
               '2025-01-17', '2025-01-18', '2025-01-19', '2025-01-20',
               '2025-01-21', '2025-01-22', '2025-01-23', '2025-01-24',
               '2025-01-25', '2025-01-26', '2025-01-27', '2025-01-28',
               '2025-01-29', '2025-01-30', '2025-01-31'],
              dtype='datetime64[ns]', freq='D')

In [95]:
hours = pd.date_range("2025-01-01", periods=24, freq="H")
hours

DatetimeIndex(['2025-01-01 00:00:00', '2025-01-01 01:00:00',
               '2025-01-01 02:00:00', '2025-01-01 03:00:00',
               '2025-01-01 04:00:00', '2025-01-01 05:00:00',
               '2025-01-01 06:00:00', '2025-01-01 07:00:00',
               '2025-01-01 08:00:00', '2025-01-01 09:00:00',
               '2025-01-01 10:00:00', '2025-01-01 11:00:00',
               '2025-01-01 12:00:00', '2025-01-01 13:00:00',
               '2025-01-01 14:00:00', '2025-01-01 15:00:00',
               '2025-01-01 16:00:00', '2025-01-01 17:00:00',
               '2025-01-01 18:00:00', '2025-01-01 19:00:00',
               '2025-01-01 20:00:00', '2025-01-01 21:00:00',
               '2025-01-01 22:00:00', '2025-01-01 23:00:00'],
              dtype='datetime64[ns]', freq='H')

In [96]:
df2 = df.set_index("Timestamp").sort_index()
df2.head(4)

,UserID,SessionID,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile,...,date,month_name,weekday,weekday_name,ts_5min,ts_hour,ts_day,ts_ceil_hour,ts_round_15m,quarter
Timestamp,,,,,,,,,,,,,,,,,,,,,
2024-01-01 00:01:35.004064,176,7,logout,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0,Monday,2024-01-01 00:00:00,2024-01-01,2024-01-01,2024-01-01 01:00:00,2024-01-01 00:00:00,2024Q1
2024-01-01 00:02:24.971658,976,4,product_view,prod_1303,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0,Monday,2024-01-01 00:00:00,2024-01-01,2024-01-01,2024-01-01 01:00:00,2024-01-01 00:00:00,2024Q1
2024-01-01 00:06:24.553313,925,2,login,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0,Monday,2024-01-01 00:05:00,2024-01-01,2024-01-01,2024-01-01 01:00:00,2024-01-01 00:00:00,2024Q1
2024-01-01 00:26:02.151406,624,1,product_view,prod_6754,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0,Monday,2024-01-01 00:25:00,2024-01-01,2024-01-01,2024-01-01 01:00:00,2024-01-01 00:30:00,2024Q1

In [97]:
print(df2.index.min(), "|", df2.index.max())

2024-01-01 00:01:35.004064 | 2024-07-24 10:13:04.983908

In [98]:
### use pd.date_range to generate time ranges
pd.date_range(df2.index.min(), df2.index.max(), freq="D")

DatetimeIndex(['2024-01-01 00:01:35.004064', '2024-01-02 00:01:35.004064',
               '2024-01-03 00:01:35.004064', '2024-01-04 00:01:35.004064',
               '2024-01-05 00:01:35.004064', '2024-01-06 00:01:35.004064',
               '2024-01-07 00:01:35.004064', '2024-01-08 00:01:35.004064',
               '2024-01-09 00:01:35.004064', '2024-01-10 00:01:35.004064',
               ...
               '2024-07-15 00:01:35.004064', '2024-07-16 00:01:35.004064',
               '2024-07-17 00:01:35.004064', '2024-07-18 00:01:35.004064',
               '2024-07-19 00:01:35.004064', '2024-07-20 00:01:35.004064',
               '2024-07-21 00:01:35.004064', '2024-07-22 00:01:35.004064',
               '2024-07-23 00:01:35.004064', '2024-07-24 00:01:35.004064'],
              dtype='datetime64[ns]', length=206, freq='D')

In [99]:
### Very common patterns: reindex to full calendar then fill
df2 = df[df.UserID == "1"]
df2 = df2.drop_duplicates(["Date"], keep="first")
df2 = df2.set_index("Timestamp").sort_index()
df2

,UserID,SessionID,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile,...,date,month_name,weekday,weekday_name,ts_5min,ts_hour,ts_day,ts_ceil_hour,ts_round_15m,quarter
Timestamp,,,,,,,,,,,,,,,,,,,,,
2024-01-01 23:09:51.956825,1,1,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02 00:00:00,2024-01-01 23:15:00,2024Q1
2024-01-02 00:15:51.420238,1,4,add_to_cart,prod_6144,NaN,NaN,2024-01-02,0.0,NaN,NaN,...,2024-01-02,January,1,Tuesday,2024-01-02 00:15:00,2024-01-02 00:00:00,2024-01-02,2024-01-02 01:00:00,2024-01-02 00:15:00,2024Q1
2024-01-03 23:51:05.729189,1,5,logout,NaN,NaN,NaN,2024-01-03,0.0,NaN,NaN,...,2024-01-03,January,2,Wednesday,2024-01-03 23:50:00,2024-01-03 23:00:00,2024-01-03,2024-01-04 00:00:00,2024-01-03 23:45:00,2024Q1
2024-01-04 09:25:49.705624,1,4,add_to_cart,prod_1102,NaN,NaN,2024-01-04,0.0,NaN,NaN,...,2024-01-04,January,3,Thursday,2024-01-04 09:25:00,2024-01-04 09:00:00,2024-01-04,2024-01-04 10:00:00,2024-01-04 09:30:00,2024Q1
2024-01-06 04:33:39.275154,1,9,page_view,NaN,NaN,NaN,2024-01-06,0.0,NaN,NaN,...,2024-01-06,January,5,Saturday,2024-01-06 04:30:00,2024-01-06 04:00:00,2024-01-06,2024-01-06 05:00:00,2024-01-06 04:30:00,2024Q1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2024-07-07 18:00:26.959902,1,1,page_view,NaN,NaN,NaN,2024-07-07,0.0,NaN,NaN,...,2024-07-07,July,6,Sunday,2024-07-07 18:00:00,2024-07-07 18:00:00,2024-07-07,2024-07-07 19:00:00,2024-07-07 18:00:00,2024Q3
2024-07-15 16:15:52.074487,1,4,purchase,prod_9886,7.677938,purchase,2024-07-15,0.0,7.677938,106.869794,...,2024-07-15,July,0,Monday,2024-07-15 16:15:00,2024-07-15 16:00:00,2024-07-15,2024-07-15 17:00:00,2024-07-15 16:15:00,2024Q3
2024-07-17 03:46:13.897763,1,3,add_to_cart,prod_6426,NaN,NaN,2024-07-17,0.0,NaN,NaN,...,2024-07-17,July,2,Wednesday,2024-07-17 03:45:00,2024-07-17 03:00:00,2024-07-17,2024-07-17 04:00:00,2024-07-17 03:45:00,2024Q3
2024-07-18 01:56:58.108233,1,7,product_view,prod_3548,NaN,NaN,2024-07-18,0.0,NaN,NaN,...,2024-07-18,July,3,Thursday,2024-07-18 01:55:00,2024-07-18 01:00:00,2024-07-18,2024-07-18 02:00:00,2024-07-18 02:00:00,2024Q3
2024-07-22 20:10:14.181302,1,10,add_to_cart,prod_7361,NaN,NaN,2024-07-22,0.0,NaN,NaN,...,2024-07-22,July,0,Monday,2024-07-22 20:10:00,2024-07-22 20:00:00,2024-07-22,2024-07-22 21:00:00,2024-07-22 20:15:00,2024Q3

In [100]:
df2 = df2.reindex(pd.date_range(df2.index.min(), df2.index.max(), freq="D")).ffill()
df2

,UserID,SessionID,EventType,ProductID,Amount,Outcome,Date,AmountKept,AmountClipped,AmountClippedQuantile,...,date,month_name,weekday,weekday_name,ts_5min,ts_hour,ts_day,ts_ceil_hour,ts_round_15m,quarter
2024-01-01 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-01-02 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-01-03 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-01-04 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-01-05 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2024-07-17 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-07-18 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-07-19 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-07-20 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1
2024-07-21 23:09:51.956825,1,1.0,page_view,NaN,NaN,NaN,2024-01-01,0.0,NaN,NaN,...,2024-01-01,January,0.0,Monday,2024-01-01 23:05:00,2024-01-01 23:00:00,2024-01-01,2024-01-02,2024-01-01 23:15:00,2024Q1

In [101]:
### pd.Timedelta: duration
df["Timestamp_Plus_2H"] = df["Timestamp"] + pd.Timedelta(hours=2)
df["Timestamp_Plus_7D"] = df["Timestamp"] + pd.Timedelta("7D")
df[["Timestamp", "Timestamp_Plus_2H", "Timestamp_Plus_7D"]].head()

,Timestamp,Timestamp_Plus_2H,Timestamp_Plus_7D
0,2024-07-07 18:00:26.959902,2024-07-07 20:00:26.959902,2024-07-14 18:00:26.959902
1,2024-03-05 22:01:00.072000,2024-03-06 00:01:00.072000,2024-03-12 22:01:00.072000
2,2024-03-23 22:08:10.568453,2024-03-24 00:08:10.568453,2024-03-30 22:08:10.568453
3,2024-03-12 00:32:05.495638,2024-03-12 02:32:05.495638,2024-03-19 00:32:05.495638
4,2024-02-25 22:43:01.318876,2024-02-26 00:43:01.318876,2024-03-03 22:43:01.318876

In [102]:
### .diff()
df["TimeDelta"] = df["Timestamp"].diff()
df[["Timestamp", "TimeDelta"]].head()

                   Timestamp                  TimeDelta
0 2024-07-07 18:00:26.959902                        NaT
1 2024-03-05 22:01:00.072000 -124 days +04:00:33.112098
2 2024-03-23 22:08:10.568453    18 days 00:07:10.496453
3 2024-03-12 00:32:05.495638  -12 days +02:23:54.927185
4 2024-02-25 22:43:01.318876  -16 days +22:10:55.823238

In [103]:
### pd.DateOffset(): calendar logics such as months, business days
### Notice that pd.Timedelta(days=30) is not "one month" -> months vary
### DateOffset(months=1) is a truly month shift

df["NextMonthSameDay"] = df["Timestamp"] + pd.DateOffset(months=1)
df["PrevYear"] = df["Timestamp"] - pd.DateOffset(years=1)
df[["Timestamp", "PrevYear", "NextMonthSameDay"]].head()

,Timestamp,PrevYear,NextMonthSameDay
0,2024-07-07 18:00:26.959902,2023-07-07 18:00:26.959902,2024-08-07 18:00:26.959902
1,2024-03-05 22:01:00.072000,2023-03-05 22:01:00.072000,2024-04-05 22:01:00.072000
2,2024-03-23 22:08:10.568453,2023-03-23 22:08:10.568453,2024-04-23 22:08:10.568453
3,2024-03-12 00:32:05.495638,2023-03-12 00:32:05.495638,2024-04-12 00:32:05.495638
4,2024-02-25 22:43:01.318876,2023-02-25 22:43:01.318876,2024-03-25 22:43:01.318876

In [104]:
### Business Day Example

from pandas.tseries.offsets import BDay
df["next_bday"] = df["Timestamp"] + BDay(1)
df[["Timestamp", "next_bday"]].head()

                   Timestamp                  next_bday
0 2024-07-07 18:00:26.959902 2024-07-08 18:00:26.959902
1 2024-03-05 22:01:00.072000 2024-03-06 22:01:00.072000
2 2024-03-23 22:08:10.568453 2024-03-25 22:08:10.568453
3 2024-03-12 00:32:05.495638 2024-03-13 00:32:05.495638
4 2024-02-25 22:43:01.318876 2024-02-26 22:43:01.318876

### Groupby, Aggregation, and Window-ish Ops
- groupby
- agg (named aggregation)
- size, count, sum, mean, median, min, max, std
- nunique, first, last
- value_counts (within group via groupby(...).value_counts())
- transform
- apply (with caution)
- cumcount, cumsum, cummax, cummin
- shift, diff
- pct_change

In [105]:
cols = ["UserID", "SessionID", "Timestamp", "EventType", "ProductID", "Amount", "Outcome"]
df = df[cols].copy()

In [106]:
### Total events per user
df.groupby(["UserID"]).size()

UserID
1       82
10      81
100     76
1000    82
101     76
        ..
995     75
996     75
997     78
998     72
999     75
Length: 1000, dtype: int64

In [107]:
### Events per (User, Session)
df.groupby(["UserID", "SessionID"]).size()

UserID  SessionID
1       1             9
        2             6
        3             9
        4            10
        5             9
                     ..
999     6             5
        7            10
        8             8
        9            10
        10            9
Length: 10000, dtype: int64

In [108]:
### Named aggregation (best practice for clean columns)
out = (df.groupby("UserID")
         .agg(
             n_events_NA=("EventType", "size"), # including NA
             n_events=("EventType", "count"), # not including NA
             n_sessions=("SessionID", "nunique"),
             total_amt=("Amount", "sum"),
             avg_amt=("Amount", "mean"),
             first_ts=("Timestamp", "min"),
             last_ts=("Timestamp", "max"),
         )
         .reset_index())
out.head()

,UserID,n_events_NA,n_events,n_sessions,total_amt,avg_amt,first_ts,last_ts
0,1,82,82,10,1996.128780,249.516097,2024-01-01 23:09:51.956825,2024-07-22 20:10:14.181302
1,10,81,81,10,3567.334590,198.185255,2024-01-01 08:01:45.649799,2024-07-23 22:50:17.279206
2,100,76,76,10,3591.513958,239.434264,2024-01-01 18:49:13.031574,2024-07-24 10:13:04.983908
3,1000,82,82,10,3056.475836,218.319703,2024-01-03 15:54:55.591340,2024-07-21 05:48:07.728611
4,101,76,76,10,3057.296506,203.819767,2024-01-02 23:53:55.015078,2024-07-24 07:37:22.603563

- size, count, sum, mean, median, min, max, std

In [109]:
# df.groupby("UserID").size()
# df.groupby("UserID")["Amount"].count()
# df.groupby("UserID")["Amount"].sum()
# df.groupby("UserID")["Amount"].mean()
# df.groupby("UserID")["Amount"].std()

- nunique, first, last

In [110]:
# unique event type per user
df.groupby("UserID")["EventType"].nunique().reset_index().sort_values("UserID", ascending=True)

    UserID  EventType
0        1          8
1       10          7
2      100          7
3     1000          7
4      101          7
..     ...        ...
995    995          7
996    996          7
997    997          7
998    998          7
999    999          7

[1000 rows x 2 columns]

In [111]:
# first/last product id per session, depending on the row order
df_sorted = df.sort_values(["SessionID", "ProductID"])

out = df_sorted.groupby("SessionID")["ProductID"].first()
out2 = df_sorted.groupby("SessionID")["ProductID"].last()

In [112]:
out.head()

SessionID
1    prod_1000
2    prod_1001
3    prod_1001
4    prod_1006
5    prod_1007
Name: ProductID, dtype: object

In [113]:
out2.head()

SessionID
1    prod_9997
2    prod_9994
3    prod_9999
4    prod_9995
5    prod_9999
Name: ProductID, dtype: object

In [114]:
### value_counts within group
### top event types by each user
counts = (df.groupby("UserID")["EventType"]
            .value_counts()
            .rename("n_EventType")
            .reset_index())
counts

     UserID     EventType  n_EventType
0         1   add_to_cart           22
1         1     page_view           15
2         1  product_view           14
3         1         login           11
4         1      purchase            8
...     ...           ...          ...
6996    999         click           11
6997    999        logout           11
6998    999     page_view           10
6999    999   add_to_cart            9
7000    999  product_view            9

[7001 rows x 3 columns]

In [115]:
### top 1 event type by each user
top1 = (counts.sort_values(["UserID", "n_EventType"], ascending=[True, False])
              .groupby("UserID")
              .head(1))
top1

     UserID     EventType  n_EventType
0         1   add_to_cart           22
8        10      purchase           18
15      100  product_view           16
22     1000        logout           15
29      101      purchase           15
...     ...           ...          ...
6966    995         login           13
6973    996         click           12
6980    997  product_view           15
6987    998  product_view           17
6994    999         login           13

[1000 rows x 3 columns]

In [116]:
### transform: group-wise features
df["UserAvgAmount"] = df.groupby("UserID")["Amount"].transform("mean")
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,UserAvgAmount
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,249.516097
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,249.516097
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,249.516097
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,249.516097
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,249.516097

In [117]:
### Z-score within the User
g = df.groupby("UserID")["Amount"]
df["AmountZscore"] = (df["Amount"] - g.transform("mean")) / g.transform("std")
df.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,UserAvgAmount,AmountZscore
0,1,1,2024-07-07 18:00:26.959902,page_view,NaN,NaN,NaN,249.516097,NaN
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,249.516097,NaN
2,1,1,2024-03-23 22:08:10.568453,product_view,prod_8199,NaN,NaN,249.516097,NaN
3,1,1,2024-03-12 00:32:05.495638,AABBCCDD,prod_4112,NaN,NaN,249.516097,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,249.516097,NaN

In [118]:
### Rank with sessions
df_sorted = df.sort_values(["SessionID", "Timestamp"])
df_sorted["EventRank"] = df_sorted.groupby("SessionID").cumcount() + 1
df_sorted.tail()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,UserAvgAmount,AmountZscore,EventRank
7551,101,10,2024-07-24 07:37:22.603563,purchase,prod_4254,82.10062,purchase,203.819767,-0.953084,7427
66618,891,10,2024-07-24 08:26:18.040987,click,NaN,NaN,NaN,261.554034,NaN,7428
51459,688,10,2024-07-24 09:21:08.889919,logout,NaN,NaN,NaN,250.022975,NaN,7429
1457,19,10,2024-07-24 09:24:35.846976,page_view,NaN,NaN,NaN,301.640693,NaN,7430
58486,782,10,2024-07-24 09:41:11.623478,click,NaN,NaN,NaN,218.001706,NaN,7431

In [119]:
### cumcount, cumsum, cummax, cummin (running features)

# df_sorted = df.sort_values(["UserID", "Timestamp"])
# df_sorted["CumAmount"] = df_sorted.groupby("UserID").cumcount()
# df_sorted["CumsumAmount"] = df_sorted.groupby("UserID")["Amount"].cumsum()
# df_sorted["CummaxAmount"] = df_sorted.groupby("UserID")["Amount"].cummax()

In [120]:
### shift

df_sorted = df[df["UserID"] == "1"].sort_values(["UserID", "SessionID", "Timestamp"])
df_sorted.head()

,UserID,SessionID,Timestamp,EventType,ProductID,Amount,Outcome,UserAvgAmount,AmountZscore
5,1,1,2024-01-01 23:09:51.956825,page_view,NaN,NaN,NaN,249.516097,NaN
6,1,1,2024-02-01 05:13:26.944169,add_to_cart,prod_4965,NaN,NaN,249.516097,NaN
7,1,1,2024-02-14 15:41:53.071258,login,NaN,NaN,NaN,249.516097,NaN
4,1,1,2024-02-25 22:43:01.318876,add_to_cart,prod_3354,NaN,NaN,249.516097,NaN
1,1,1,2024-03-05 22:01:00.072000,page_view,NaN,NaN,NaN,249.516097,NaN

In [121]:
df_sorted["PrevTimestamp"] = df_sorted.groupby("SessionID")["Timestamp"].shift(1)
df_sorted["SecGap"] = (df_sorted["Timestamp"] - df_sorted["PrevTimestamp"]).dt.total_seconds()

df_sorted[["UserID", "SessionID", "Timestamp", "PrevTimestamp", "SecGap"]].head()

,UserID,SessionID,Timestamp,PrevTimestamp,SecGap
5,1,1,2024-01-01 23:09:51.956825,NaT,NaN
6,1,1,2024-02-01 05:13:26.944169,2024-01-01 23:09:51.956825,2.613815e+06
7,1,1,2024-02-14 15:41:53.071258,2024-02-01 05:13:26.944169,1.160906e+06
4,1,1,2024-02-25 22:43:01.318876,2024-02-14 15:41:53.071258,9.756682e+05
1,1,1,2024-03-05 22:01:00.072000,2024-02-25 22:43:01.318876,7.750788e+05

In [122]:
### diff

df_sorted["TimestampDiff"] = df_sorted["Timestamp"].diff().dt.total_seconds()
df_sorted[["UserID", "SessionID", "Timestamp", "TimestampDiff", "SecGap"]].head()

  UserID  SessionID                  Timestamp  TimestampDiff        SecGap
5      1          1 2024-01-01 23:09:51.956825            NaN           NaN
6      1          1 2024-02-01 05:13:26.944169   2.613815e+06  2.613815e+06
7      1          1 2024-02-14 15:41:53.071258   1.160906e+06  1.160906e+06
4      1          1 2024-02-25 22:43:01.318876   9.756682e+05  9.756682e+05
1      1          1 2024-03-05 22:01:00.072000   7.750788e+05  7.750788e+05

In [123]:
### pct_change

df2 = (df.groupby(["UserID", "SessionID"])["Amount"].sum()
           .rename("SessionTotalAmount")
           .reset_index()
           .sort_values(["UserID", "SessionID", "SessionTotalAmount"]))
df2["pct_change"] = df2["SessionTotalAmount"].pct_change()
df2.head()

  UserID  SessionID  SessionTotalAmount  pct_change
0      1          1            0.000000         NaN
1      1          2            0.000000         NaN
2      1          3           72.913619         inf
3      1          4            7.677938   -0.894698
4      1          5          998.570616  129.057139

### Reshaping data (winde <-> long)
- `pivot, pivot_table`: long->wide
- `melt`: wide->long (unpivot columns into variables + values)
- `stack`: columns->rows, requires MultiIndex, common after unstack
- `unstack`: rows->columns, requires MultiIndex, common after groupby
- `crosstab`: quick count table

- pivot, pivot_table: Long->Wide table

In [124]:
session_wide = (
    df.pivot_table(
        index=["UserID", "SessionID"], # group rows by each user-session pair, the output will have one row per session
        columns="EventType", # take every unique value in EventType, and make them separate columns 
        values="Timestamp",
        aggfunc="count",  # inside each (UserID, SessionID, EventType) bucket, count how many rows there are
        fill_value=0 # If a session never had a certain event type, youd normally get NaN. This turns those into 0
    )
    .reset_index()
)
session_wide.head()

EventType,UserID,SessionID,AABBCCDD,add_to_cart,click,login,logout,page_view,product_view,purchase
0,1,1,1,2,1,1,0,3,1,0
1,1,2,0,0,1,0,1,3,1,0
2,1,3,0,3,1,2,0,1,1,1
3,1,4,0,4,0,2,0,2,1,1
4,1,5,0,0,1,1,1,1,1,4

In [125]:
prod_funnel = (
    df.dropna(subset=["ProductID"])
      .assign(flag=1)
      .pivot_table(
          index=["UserID","SessionID","ProductID"],
          columns="EventType",
          values="flag",
          aggfunc="max",
          fill_value=0
      )
      .reset_index()
)

prod_funnel.head()

EventType,UserID,SessionID,ProductID,AABBCCDD,add_to_cart,product_view,purchase
0,1,1,prod_3354,0,1,0,0
1,1,1,prod_4112,1,0,0,0
2,1,1,prod_4965,0,1,0,0
3,1,1,prod_8199,0,0,1,0
4,1,2,prod_2683,0,0,1,0

- crosstab: counts how many times categories occur across combinations of columns

In [126]:
pd.crosstab(df["EventType"], df["Outcome"])          # EventType x Outcome

Outcome    purchase
EventType
purchase      10682

In [127]:
pd.crosstab(df["UserID"], df["EventType"])          # User x EventType counts

EventType,AABBCCDD,add_to_cart,click,login,logout,page_view,product_view,purchase
UserID,,,,,,,,
1,1,22,5,11,6,15,14,8
10,0,7,9,11,12,14,10,18
100,0,9,6,7,14,9,16,15
1000,0,11,12,11,15,5,14,14
101,0,10,10,11,10,11,9,15
...,...,...,...,...,...,...,...,...
995,0,9,10,13,12,11,11,9
996,0,10,12,8,9,12,12,12
997,0,7,12,12,11,14,15,7
998,0,13,10,5,10,11,17,6
999,0,9,11,13,11,10,9,12

In [128]:
pd.crosstab(df["SessionID"], df["EventType"])       # Session x EventType counts

EventType,AABBCCDD,add_to_cart,click,login,logout,page_view,product_view,purchase
SessionID,,,,,,,,
1,1,1063,1080,1008,1085,1094,1063,1026
2,0,1083,997,1016,1124,1065,1107,1043
3,0,1071,1068,1085,1083,1090,1085,1016
4,0,1055,1074,1083,1059,1057,1042,1091
5,0,1063,1101,1111,1026,1084,1038,1058
6,0,1091,1068,1038,1000,1067,1085,1082
7,0,1074,1064,1051,1061,1057,1087,1138
8,0,1086,1074,1080,1083,1078,1054,1125
9,0,1083,1040,1070,1107,1111,1085,1052
10,0,1065,1066,1026,1057,1116,1050,1051

- melt: Wide->Long table

In [129]:
prod_funnel.head()

EventType,UserID,SessionID,ProductID,AABBCCDD,add_to_cart,product_view,purchase
0,1,1,prod_3354,0,1,0,0
1,1,1,prod_4112,1,0,0,0
2,1,1,prod_4965,0,1,0,0
3,1,1,prod_8199,0,0,1,0
4,1,2,prod_2683,0,0,1,0

In [130]:
long_again = prod_funnel.melt(
    id_vars=["UserID", "SessionID", "ProductID"],
    var_name="EventType",
    value_name="Count"
)

long_again.sample(10)

       UserID  SessionID  ProductID     EventType  Count
11007     406          7  prod_1563      AABBCCDD      0
117977    705          5  prod_3294      purchase      1
101036    230          7  prod_6597      purchase      0
111779    532         10  prod_1239      purchase      0
112363    549          5  prod_8965      purchase      0
100943    228          6  prod_1964      purchase      0
8997      353          2  prod_6748      AABBCCDD      0
70938      29          6  prod_7194  product_view      0
123751    868          6  prod_9587      purchase      1
65030     119          5  prod_1752  product_view      0

- stack/ unstack

In [131]:
g = df.groupby(["UserID", "SessionID", "EventType"]).size()
g.head()

UserID  SessionID  EventType
1       1          AABBCCDD       1
                   add_to_cart    2
                   click          1
                   login          1
                   page_view      3
dtype: int64

In [132]:
### same idea as pivot, but via MultiIndex
wide = g.unstack("EventType", fill_value=0).reset_index()
wide.head()

EventType,UserID,SessionID,AABBCCDD,add_to_cart,click,login,logout,page_view,product_view,purchase
0,1,1,1,2,1,1,0,3,1,0
1,1,2,0,0,1,0,1,3,1,0
2,1,3,0,3,1,2,0,1,1,1
3,1,4,0,4,0,2,0,2,1,1
4,1,5,0,0,1,1,1,1,1,4

In [133]:
back_to_long = wide.set_index(["UserID","SessionID"]).stack().reset_index(name="Count")
back_to_long.head()

  UserID  SessionID    EventType  Count
0      1          1     AABBCCDD      1
1      1          1  add_to_cart      2
2      1          1        click      1
3      1          1        login      1
4      1          1       logout      0

### Joining, Merging, Concatenation
- `merge` (left/ right/ inner/ outer, validate=): SQL join on columns
- `join`: merge on index (handy after set_index)
- `concat`: stack data vertically/ horizontally (no key matching)
- `merge_asof` (time-series closest prior joins): time-based "latest prior/ nearest" matching
- `combine_first`: fill missing values from another source

In [134]:
### merge()

# out = left.merge(right, on="UserID", how="inner")   # only matches
# out = left.merge(right, on="UserID", how="left")    # keep all left rows
# out = left.merge(right, on="UserID", how="right")    # keep all right rows
# out = left.merge(right, on="UserID", how="outer")   # keep all rows from both

- join on different column names

In [135]:
# out = left.merge(right, left_on="user_id", right_on="UserID", how="left")

- multiple keys

In [136]:
# out = left.merge(right, on=["UserID", "SessionID"], how="left")

- validate: catch data bugs

In [137]:
# out = left.merge(
#     right, 
#     on="UserID", 
#     how="left", 
#     validate="one_to_many"
# )

- "validate" is a safety check on the key uniqueness before pandas actually does the merge.
- If the data doesnt match the relationship you claim, pandas raises a MergeError.

`This enforces`
- left: each UserID appears at most once (unique key)
- right: a UserID can appear multiple times

So one row on the left can match many rows on the right  output can have more rows than left (row duplication of left rows).

In [138]:
# both sides unique per key

# out = left.merge(right, on="UserID", how="left", validate="one_to_one")

`This enforces`
- left: UserID is unique
- right: UserID is also unique

So each left row matches 0 or 1 right row  output row count will be exactly len(left) (for a left join).

- join() vs. merge()
- `merge` joins on columns, `join` joins on index (unless you pass on=).
- join(): index-based merge shortcut

In [139]:
# out = left.set_index("UserID").join(
#     right.set_index("UserID"),
#     how="left",
#     rsuffix="_r"
# ).reset_index()

- `concat`: Used to append rows or append columns

In [140]:
# ### stack rows: 

# # same columns, more rows
# out = pd.concat([df_jan, df_feb], axis=0, ignore_index=True)

# # same index, more columns
# out = pd.concat([features_a, features_b], axis=1)

- `merge_asof`: Time-series "closest prior" join

- Use when you want to match each row to the nearest earlier (or nearest) timestamp.
- Classic: join trades to last quote, or events to the latest feature snapshot.

`Requirements`
- Both sides sorted by TimeoutError
- time keys are datetime

In [141]:
# events = events.sort_values("Timestamp")
# snap   = snap.sort_values("Timestamp")

# out = pd.merge_asof(
#     events,
#     snap,
#     on="Timestamp",
#     by="UserID",          # optional: also match within each user
#     direction="backward", # "backward" (last prior), "forward", or "nearest"
#     tolerance=pd.Timedelta("5min")  # optional max gap
# )

- `combine-first`: fill missing values from another series/ df

In [142]:
# df["Amount_final"] = df["Amount_primary"].combine_first(df["Amount_backup"])

### Missing Data Handling
- isna, notna
- fillna (scalar / method like ffill/bfill)
- ffill, bfill
- interpolate (common in time series)
- dropna

- `isna()`
- `notna()`

In [143]:
data = pd.DataFrame({
    "UserID": [1, 2, 3, 4],
    "Amount": [10.0, np.nan, 30.0, np.nan],
    "Outcome": ["success", None, "fail", None],
})
data

   UserID  Amount  Outcome
0       1    10.0  success
1       2     NaN     None
2       3    30.0     fail
3       4     NaN     None

In [144]:
# boolean mask DataFrame
data.isna()

   UserID  Amount  Outcome
0   False   False    False
1   False    True     True
2   False   False    False
3   False    True     True

In [145]:
data["Outcome"].isna()

0    False
1     True
2    False
3     True
Name: Outcome, dtype: bool

In [146]:
data[data["Amount"].notna()]

   UserID  Amount  Outcome
0       1    10.0  success
2       3    30.0     fail

- `fillna()`

In [147]:
data["AmountFilled"] = data["Amount"].fillna(0)
data["OutcomeFilled"] = data["Outcome"].fillna("unknown")
data.head()

   UserID  Amount  Outcome  AmountFilled OutcomeFilled
0       1    10.0  success          10.0       success
1       2     NaN     None           0.0       unknown
2       3    30.0     fail          30.0          fail
3       4     NaN     None           0.0       unknown

- `fillna()` with dict (different columns, different values)

In [148]:
data2 = data.fillna({"Amount": 0, "Outcome": "unknown"})
data2.head()

   UserID  Amount  Outcome  AmountFilled OutcomeFilled
0       1    10.0  success          10.0       success
1       2     0.0  unknown           0.0       unknown
2       3    30.0     fail          30.0          fail
3       4     0.0  unknown           0.0       unknown

- forward fill: `ffill()`
- backward fill: `bfill()`

In [149]:
data_fill = data.sort_values("UserID").copy()
data_fill["Outcome_ffill"] = data_fill["Outcome"].ffill()
data_fill["Outcome_bfill"] = data_fill["Outcome"].bfill()
data_fill.head()

,UserID,Amount,Outcome,AmountFilled,OutcomeFilled,Outcome_ffill,Outcome_bfill
0,1,10.0,success,10.0,success,success,success
1,2,NaN,None,0.0,unknown,success,fail
2,3,30.0,fail,30.0,fail,fail,fail
3,4,NaN,None,0.0,unknown,fail,None

In [150]:
### Equivalent
data_fill["Outcome_ffill_2"] = data_fill["Outcome"].fillna(method="ffill")
data_fill.head()

,UserID,Amount,Outcome,AmountFilled,OutcomeFilled,Outcome_ffill,Outcome_bfill,Outcome_ffill_2
0,1,10.0,success,10.0,success,success,success,success
1,2,NaN,None,0.0,unknown,success,fail,success
2,3,30.0,fail,30.0,fail,fail,fail,fail
3,4,NaN,None,0.0,unknown,fail,None,fail

- `interpolate()`: time series
- good for numeric series when smoothing fills

In [151]:
ts = pd.DataFrame(
    {"y": [1.0, np.nan, np.nan, 4.0]},
    index=pd.to_datetime(["2024-01-01", "2024-01-02", "2024-01-03", "2024-01-04"])
)
ts.head()

              y
2024-01-01  1.0
2024-01-02  NaN
2024-01-03  NaN
2024-01-04  4.0

In [152]:
ts["y_linear"] = ts["y"].interpolate()  # 2.0, 3.0 filled linearly
ts.head()

              y  y_linear
2024-01-01  1.0       1.0
2024-01-02  NaN       2.0
2024-01-03  NaN       3.0
2024-01-04  4.0       4.0

- `dropna()`: drop rows with any missing
- `dropna(axis=1)`: drop columns that have any missing

In [153]:
data

   UserID  Amount  Outcome  AmountFilled OutcomeFilled
0       1    10.0  success          10.0       success
1       2     NaN     None           0.0       unknown
2       3    30.0     fail          30.0          fail
3       4     NaN     None           0.0       unknown

In [154]:
data_drop_any = data.dropna()
data_drop_any

   UserID  Amount  Outcome  AmountFilled OutcomeFilled
0       1    10.0  success          10.0       success
2       3    30.0     fail          30.0          fail

In [155]:
df_drop_thresh = data.dropna(thresh=2)  # keep rows with >=2 non-NA values
df_drop_thresh

   UserID  Amount  Outcome  AmountFilled OutcomeFilled
0       1    10.0  success          10.0       success
1       2     NaN     None           0.0       unknown
2       3    30.0     fail          30.0          fail
3       4     NaN     None           0.0       unknown

In [156]:
df_drop_cols = data.dropna(axis=1)
df_drop_cols

   UserID  AmountFilled OutcomeFilled
0       1          10.0       success
1       2           0.0       unknown
2       3          30.0          fail
3       4           0.0       unknown

### Binning & Discretization
- cut
- qcut

### Numeric/ Vectorized Operations (often with Numpy)
- np.where, np.select
- Series.clip
- Series.abs
- Series.round
- arithmetic ops (+, -, *, /)
- Series.div, mul, add, sub
- Series.to_numpy

### Rolling, Expanding, EWM windows
- rolling (...): mean/sum/std/min/max/quantile
- expanding(...): mean/sum
- ewm(...): mean (exponential moving average)

### Category + encoding helpers

- astype("category")
- cat.codes, cat.categories
- get_dummies

### Performance / engineering essentials
- copy (avoid view bugs)
- astype (downcast types)
- select_dtypes
- memory_usage(deep=True)
- DataFrame.equals (sanity checks)
- Series.map vs merge (lookup tables)
- pd.options.mode.chained_assignment (understand warnings)